export const questionnaire = [
    {
        key: 'q1',
        title: 'Раздел 1. Эмоциональная сфера',
        questions: [
            'Ребенок часто выражает радость и удовольствие:',
            'Ребенок часто выражает радость и удовольствие:',
            'Ребенок часто грустит или плачет без видимой причины:',
            'Ребенок часто грустит или плачет без видимой причины:',
        ],
    },
    {
        key: 'q2',
        title: 'Раздел 2. Социальное взаимодействие',
        questions: [
            'Ребенок легко заводит друзей:',
            'Ребенок легко заводит друзей:',
            'Ребенок предпочитает играть один, а не с другими детьми:',
            'Ребенок предпочитает играть один, а не с другими детьми:',
        ],
    },
    {
        key: 'q3',
        title: 'Раздел 3. Саморегуляция и поведение',
        questions: [
            'Ребенок умеет следовать правилам и инструкциям:',
            'Ребенок умеет следовать правилам и инструкциям:',
            'Ребенку трудно контролировать свои импульсы:',
            'Ребенку трудно контролировать свои импульсы:',
        ],
    },
    {
        key: 'q4',
        title: 'Раздел 4. Самооценка и уверенность в себе',
        questions: [
            'Ребенок уверен в своих силах и способностях:',
            'Ребенок уверен в своих силах и способностях:',
            'Ребенок часто сомневается в себе:',
            'Ребенок часто сомневается в себе:',
        ],
    },
];

export const radioButtonsAnswers = ['Очень редко', 'Редко', 'Иногда', 'Часто', 'Всегда'];
